first_routes/app/controllers/users_controller.rb

    def create

        # user = User.new(params.require(:user).permit(:name, :email))


        # user.save!
        # render json: user
        debugger
        user = User.new(user_params)
        debugger
        if user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "YOYOYOY"], ["created_at", "2019-04-29 20:16:05.654107"], ["updated_at", "2019-04-29 20:16:05.654107"]]